**FREE

///
// Hello World Example
//
// This is a typical "Hello World!" example which uses the DSPLY opcode to 
// output the message.
// 
// \author Mihael Schmidt
// \date 2016-12-13
///


//-------------------------------------------------------------------------------------------------
// Program Entry Point
//-------------------------------------------------------------------------------------------------
dsply 'Hello World!';

*inlr = *on;
return;
