     A
     A          R MD5REC
     A            TS             8A
     A            FILENAM       10A
     A            FILELIB       10A
     A            MBRNAME       10A
     A            CRCVAL       128A
